---
kind: type
id: T:Autodesk.Revit.DB.Events.RevitAPIPostEventArgs
source: html/93554f52-0145-3454-5697-3f1015e46434.htm
---
# Autodesk.Revit.DB.Events.RevitAPIPostEventArgs

The class is used as a base class for arguments of any post-event.

## Syntax (C#)
```csharp
public class RevitAPIPostEventArgs : RevitAPIEventArgs
```

## Remarks
A post-event is the event raised after execution of the process that was related with the event.